Software Intermediation/Archive/20180413 v1.0/SoftwareIntermediationDevWSDL.v1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:si="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v1" name="SoftwareIntermediation" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/">
	<wsdl:types>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/">
			<xs:element name="Link">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q1="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkRequest" minOccurs="1" name="LinkRequestMsg" nillable="true" type="q1:LinkRequestType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="LinkResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q2="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkResponse" minOccurs="0" name="LinkResult" nillable="true" type="q2:LinkResponseType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="Delink">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q3="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkRequest" minOccurs="1" name="DelinkRequestMsg" nillable="true" type="q3:DelinkRequestType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="DelinkResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q4="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkResponse" minOccurs="0" name="DelinkResult" nillable="true" type="q4:DelinkResponseType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="RetrieveClientList">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q5="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListRequest" minOccurs="1" name="RetrieveClientListRequestMsg" nillable="true" type="q5:RetrieveClientListRequestType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="RetrieveClientListResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q6="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListResponse" minOccurs="0" name="RetrieveClientListResult" nillable="true" type="q6:RetrieveClientListResponseType"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/">
			<xs:element name="anyType" nillable="true" type="xs:anyType"/>
			<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
			<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
			<xs:element name="boolean" nillable="true" type="xs:boolean"/>
			<xs:element name="byte" nillable="true" type="xs:byte"/>
			<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
			<xs:element name="decimal" nillable="true" type="xs:decimal"/>
			<xs:element name="double" nillable="true" type="xs:double"/>
			<xs:element name="float" nillable="true" type="xs:float"/>
			<xs:element name="int" nillable="true" type="xs:int"/>
			<xs:element name="long" nillable="true" type="xs:long"/>
			<xs:element name="QName" nillable="true" type="xs:QName"/>
			<xs:element name="short" nillable="true" type="xs:short"/>
			<xs:element name="string" nillable="true" type="xs:string"/>
			<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
			<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
			<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
			<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
			<xs:element name="char" nillable="true" type="tns:char"/>
			<xs:simpleType name="char">
				<xs:restriction base="xs:int"/>
			</xs:simpleType>
			<xs:element name="duration" nillable="true" type="tns:duration"/>
			<xs:simpleType name="duration">
				<xs:restriction base="xs:duration">
					<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
					<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
					<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:element name="guid" nillable="true" type="tns:guid"/>
			<xs:simpleType name="guid">
				<xs:restriction base="xs:string">
					<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:attribute name="FactoryType" type="xs:QName"/>
			<xs:attribute name="Id" type="xs:ID"/>
			<xs:attribute name="Ref" type="xs:IDREF"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkRequest">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="LinkRequestType">
				<xs:sequence>
					<xs:element name="LinkRequestWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:linkRequest"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="LinkRequestType" nillable="true" type="tns:LinkRequestType"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientLinkResponse">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="LinkResponseType">
				<xs:sequence>
					<xs:element name="LinkResponseWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:linkDelinkResponse"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="LinkResponseType" nillable="true" type="tns:LinkResponseType"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkRequest">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="DelinkRequestType">
				<xs:sequence>
					<xs:element name="DelinkRequestWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:delinkRequest"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="DelinkRequestType" nillable="true" type="tns:DelinkRequestType"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkResponse">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="DelinkResponseType">
				<xs:sequence>
					<xs:element name="DelinkResponseWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:linkDelinkResponse"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="DelinkResponseType" nillable="true" type="tns:DelinkResponseType"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListRequest">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="RetrieveClientListRequestType">
				<xs:sequence>
					<xs:element name="RetrieveClientListRequestWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:retrieveListRequest"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="RetrieveClientListRequestType" nillable="true" type="tns:RetrieveClientListRequestType"/>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListResponse">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation" schemaLocation="SoftwareIntermediation.v1.xsd"/>
			<xs:complexType name="RetrieveClientListResponseType">
				<xs:sequence>
					<xs:element name="RetrieveClientListResponseWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="si:retrieveListResponse"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="RetrieveClientListResponseType" nillable="true" type="tns:RetrieveClientListResponseType"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="SoftwareIntermediation_Link_InputMessage">
		<wsdl:part name="parameters" element="tns:Link"/>
	</wsdl:message>
	<wsdl:message name="SoftwareIntermediation_Link_OutputMessage">
		<wsdl:part name="parameters" element="tns:LinkResponse"/>
	</wsdl:message>
	<wsdl:message name="SoftwareIntermediation_Delink_InputMessage">
		<wsdl:part name="parameters" element="tns:Delink"/>
	</wsdl:message>
	<wsdl:message name="SoftwareIntermediation_Delink_OutputMessage">
		<wsdl:part name="parameters" element="tns:DelinkResponse"/>
	</wsdl:message>
	<wsdl:message name="SoftwareIntermediation_RetrieveClientList_InputMessage">
		<wsdl:part name="parameters" element="tns:RetrieveClientList"/>
	</wsdl:message>
	<wsdl:message name="SoftwareIntermediation_RetrieveClientList_OutputMessage">
		<wsdl:part name="parameters" element="tns:RetrieveClientListResponse"/>
	</wsdl:message>
	<wsdl:portType name="SoftwareIntermediation">
		<wsdl:documentation>The SoftwareIntermediation service can be utilised to alert Inland Revenue of new software clients. For information regarding the proper use of this service, schemas, formatting of request and response types please refer to the documentation provided during onboarding.</wsdl:documentation>
		<wsdl:operation name="Link">
			<wsdl:documentation>
				<summary>For use of the SoftwareClientLink operation reference the Software Intermediation directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
				<returns>LinkResponse will contain a status and error message. See schema for more details.</returns>
				<param name="LinkRequestMsg">LinkRequest will contain client and software fields in XML format. See Software Intermediation schema for more details.</param>
			</wsdl:documentation>
			<wsdl:input message="tns:SoftwareIntermediation_Link_InputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/Link"/>
			<wsdl:output message="tns:SoftwareIntermediation_Link_OutputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/LinkResponse"/>
		</wsdl:operation>
		<wsdl:operation name="Delink">
			<wsdl:documentation>
				<summary>For use of the SoftwareClientDelink operation please reference the Software Intermediation directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
				<returns>DelinkResponse will contain a status and error message. See schema for more details.</returns>
				<param name="DelinkRequestMsg">DelinkRequest will contain client and software fields in XML format. See Software Intermediation schema for more details.</param>
			</wsdl:documentation>
			<wsdl:input message="tns:SoftwareIntermediation_Delink_InputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/Delink"/>
			<wsdl:output message="tns:SoftwareIntermediation_Delink_OutputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/DelinkResponse"/>
		</wsdl:operation>
		<wsdl:operation name="RetrieveClientList">
			<wsdl:documentation>
				<summary>For use of the RetrieveClientList operation please reference the Software Intermediation directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
				<returns>RetrieveClientListResponse will contain a status and error message along with all software clients. See schema for more details.</returns>
				<param name="RetrieveClientListRequestMsg">RetrieveSoftwareClientListRequest will contain the software identifying fields in XML format. See Software Intermediation schema for more details.</param>
			</wsdl:documentation>
			<wsdl:input message="tns:SoftwareIntermediation_RetrieveClientList_InputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/RetrieveClientList"/>
			<wsdl:output message="tns:SoftwareIntermediation_RetrieveClientList_OutputMessage" wsam:Action="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/RetrieveClientListResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="WSHttpBinding_SoftwareIntermediation" type="tns:SoftwareIntermediation">
		<soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsp:PolicyReference URI="#WSHttpBinding_SoftwareIntermediation_policy"/>
		<wsdl:operation name="Link">
			<soap12:operation soapAction="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/Link" style="document"/>
			<wsdl:input>
				<soap12:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="Delink">
			<soap12:operation soapAction="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/Delink" style="document"/>
			<wsdl:input>
				<soap12:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="RetrieveClientList">
			<soap12:operation soapAction="https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/RetrieveClientList" style="document"/>
			<wsdl:input>
				<soap12:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="SoftwareIntermediation">
		<wsdl:port name="WSHttpBinding_SoftwareIntermediation" binding="tns:WSHttpBinding_SoftwareIntermediation">
			<soap12:address location="https://xzt.services.ird.govt.nz:4046/Gateway/GWS/SoftwareIntermediation/"/>
			<wsa10:EndpointReference>
				<wsa10:Address>https://xzt.services.ird.govt.nz:4046/Gateway/GWS/SoftwareIntermediation/</wsa10:Address>
			</wsa10:EndpointReference>
		</wsdl:port>
	</wsdl:service>
	<wsp:Policy wsu:Id="WSHttpBinding_SoftwareIntermediation_policy">
		<wsp:ExactlyOne>
			<wsp:All>
				<sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
					<wsp:Policy>
						<sp:TransportToken>
							<wsp:Policy>
								<sp:HttpsToken RequireClientCertificate="false"/>
							</wsp:Policy>
						</sp:TransportToken>
						<sp:AlgorithmSuite>
							<wsp:Policy>
								<sp:Basic256/>
							</wsp:Policy>
						</sp:AlgorithmSuite>
						<sp:Layout>
							<wsp:Policy>
								<sp:Strict/>
							</wsp:Policy>
						</sp:Layout>
					</wsp:Policy>
				</sp:TransportBinding>
				<wsam:Addressing>
					<wsp:Policy>
						<wsam:AnonymousResponses/>
					</wsp:Policy>
				</wsam:Addressing>
			</wsp:All>
		</wsp:ExactlyOne>
	</wsp:Policy>
</wsdl:definitions>
