Service - Software Intermediation/Archive/20180413 v1.0/SoftwareIntermediationDelinkRequestSample

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/Delink</wsa:Action>
    </soap:Header>
    <soap:Body>
        <sof:Delink xmlns:sof="https://services.ird.govt.nz/GWS/SoftwareIntermediation/">
            <sof:DelinkRequestMsg>
                <sof1:DelinkRequestWrapper xmlns:sof1="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareClientDelinkRequest">
                    <sof2:delinkRequest xmlns:sof2="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>1.0</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="IRD">123129923</com:identifier>
                        <sof2:targetID>1500069003</sof2:targetID>
                        <sof2:targetAccount>GST</sof2:targetAccount>
                    </sof2:delinkRequest>
                </sof1:DelinkRequestWrapper>
            </sof:DelinkRequestMsg>
        </sof:Delink>
    </soap:Body>
</soap:Envelope>