Service - Software Intermediation/Archive/20180413 v1.0/SoftwareIntermediationRetrieveClientListRequestSample

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/SoftwareIntermediation/SoftwareIntermediation/RetrieveClientList</wsa:Action>
    </soap:Header>
    <soap:Body>
        <sof:RetrieveClientList xmlns:sof="https://services.ird.govt.nz/GWS/SoftwareIntermediation/">
            <sof:RetrieveClientListRequestMsg>
                <sof1:RetrieveClientListRequestWrapper xmlns:sof1="https://services.ird.govt.nz/GWS/SoftwareIntermediation/:types/SoftwareRetrieveClientListRequest">
                    <sof2:retrieveListRequest xmlns:sof2="urn:www.ird.govt.nz/GWS:types/SoftwareIntermediation">
                        <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
                            <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                            <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                            <com:softwareRelease>1.0</com:softwareRelease>
                        </com:softwareProviderData>
                        <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1" IdentifierValueType="CST">1500069003</com:identifier>
                        <sof2:clientType>AGENT</sof2:clientType>
                        <sof2:clientAccountType>GST</sof2:clientAccountType>
                    </sof2:retrieveListRequest>
                </sof1:RetrieveClientListRequestWrapper>
            </sof:RetrieveClientListRequestMsg>
        </sof:RetrieveClientList>
    </soap:Body>
</soap:Envelope>